//for
//syntax
// for (инициализация; условие; итерация) {
//     // код, который выполняется в каждой итерации
// }

for (let i = 0; i < 5; i++) {
    console.log(i); // Вывод: 0, 1, 2, 3, 4
}


//while
//sytax
// while (условие) {
//     // код, который выполняется, пока условие истинно
// }

// let i = 0;
while (i < 5) {
    console.log(i); // Вывод: 0, 1, 2, 3, 4
    i++;
}

//do_while
//syntax
// do {
//     // код, который выполняется хотя бы один раз
// } while (условие);

let i = 0;
do {
    console.log(i); // Вывод: 0, 1, 2, 3, 4
    i++;
} while (i < 5);

